app/controllers/products_controller.rb

INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "qwe"], ["description", "qwe"], ["image_url", "qwe"], ["price", 11.11], ["created_at", "2018-05-23 11:01:36.868282"], ["updated_at", "2018-05-23 11:01:36.868282"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "title" = ?, "description" = ?, "image_url" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["title", "Exploit 1"], ["description", "Hackable useful thing"], ["image_url", "wxp.jpg"], ["price", 900.0], ["updated_at", "2018-05-24 08:48:52.457128"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)